blog/2018-01-21-postgres-full-text-search-using-ecto.md.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://neiro.io/rss.xml"
      title="RSS feed for https://neiro.io/"/>
<title>Postgres full-text search using Ecto</title>
<meta name="author" content="Aleksei Kuznetsov">
    <meta name="referrer" content="no-referrer">
    <link href= "https://cdnjs.cloudflare.com/ajax/libs/normalize/8.0.1/normalize.min.css" rel="stylesheet" type="text/css" />
    <link href= "static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status">
<div class="header">
    <a href="https://neiro.io">Neiro - Functional programming, software architecture</a>
  </div></div>
<div id="content">
<div class="post-date">21 Jan 2018</div><h1 class="post-title"><a href="https://neiro.io/2018-01-21-postgres-full-text-search-using-ecto.md.html">Postgres full-text search using Ecto</a></h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#ecto-migration-to-use-the-search">1. Ecto migration to use the search</a></li>
<li><a href="#create-a-search-module">2. Create a search module</a></li>
<li><a href="#create-an-index">3. Create an index</a></li>
<li><a href="#conclusion">4. Conclusion</a></li>
</ul>
</div>
</nav>
<p>
PostgreSQL is one of the most popular, stable and common relational
database. It&rsquo;s widely used in Elixir infrastructure and has a great
integration with Ecto library.
</p>

<p>
If you&rsquo;re into web development you can often face the search problem.
You have a large stable database, you have tons of useful information,
great tools, but your users desire to find something by arbitrary
questions. You can&rsquo;t use your favourite plain SELECT &#x2026; WHERE &#x2026;
queries because you need to search for the words, not columns or
records.
</p>

<p>
This if what the full text search stands for.
</p>

<p>
Fortunately, PostgreSQL has a built-in support of the full-text search.
It allows you to parse your data into tokens, convert these tokens to
lexemes - normalised forms of words - and, finally, search and make
search optimisations.
</p>

<div id="outline-container-ecto-migration-to-use-the-search" class="outline-2">
<h2 id="ecto-migration-to-use-the-search"><span class="section-number-2">1</span> Ecto migration to use the search</h2>
<div class="outline-text-2" id="text-ecto-migration-to-use-the-search">
<p>
Let&rsquo;s start by creating a migration. Create a new Elixir project and a
new migration in priv/repo/migrations:
</p>

<pre class="example" id="org25645b0">
  defmodule App.Repo.Migrations.IntroducePgSearch do
    @moduledoc """
    Create postgres extension and indices
    """

    use Ecto.Migration

    def up do
      execute("CREATE EXTENSION pg_trgm")
    end

    def down do
      execute("DROP EXTENSION pg_trgm")
    end
  end
</pre>

<p>
As you can see, we will use PostgreSQL extension called pg<sub>trgm</sub>. Run
ecto.migrate to execute this migration. Now you can use trigram indices
and trigram matching for your full-text search.
</p>
</div>
</div>

<div id="outline-container-create-a-search-module" class="outline-2">
<h2 id="create-a-search-module"><span class="section-number-2">2</span> Create a search module</h2>
<div class="outline-text-2" id="text-create-a-search-module">
<p>
Our next step will be creating a search module. Let&rsquo;s suppose that you
already have a User schema with a username, first name and last name
defined. In that case we can implement a simple search query that can be
used in your contexts or controllers:
</p>

<pre class="example" id="org95ea0e2">
  defmodule App.Users.Search do
    @moduledoc """
    Implementation of the full-text user search
    """

    import Ecto.Query

    @spec run(Ecto.Query.t(), any()) :: Ecto.Query.t()
    def run(query, search_term) do
    end
  end
</pre>

<p>
As you can see here, we&rsquo;re defining the run function that will accept
another Ecto.Query with the search term and will return Ecto.Query
though.
</p>

<p>
We need to escape all of non-words characters from user&rsquo;s input:
</p>

<pre class="example" id="orgcd96ea5">
  String.replace(term, ~r/\W/u, "")
</pre>

<p>
Also we need to allow to search by prefix - beginning of the word. Let&rsquo;s
add :* to our search term*:
</p>

<pre class="example" id="org926a5e6">
  defp prefix_search(term), do: String.replace(term, ~r/\W/u, "") &lt;&gt; ":*"
</pre>

<p>
Now we need to implement the search by using Ecto&rsquo;s fragment macro and
to<sub>tsquery</sub> PostgreSQL function:
</p>

<pre class="example" id="org8f71e7a">
  def run(query, search_term) do
      where(
        query,
        fragment(
          "to_tsvector('english', username || ' ' || first_name || ' ' || coalesce(last_name, ' ')) @@
          to_tsquery(?)",
          ^prefix_search(search_term)
        )
      )
    end
</pre>

<p>
Let&rsquo;s take a look at the implementation. At first, we need to compose a
search token by joining columns:
</p>

<pre class="example" id="orgc557b10">
  to_tsvector('english', username || ' ' || first_name || ' ' || coalesce(last_name, ' ')) @@ to_tsquery(?)
</pre>

<p>
Created tsvector will be tested by operator @@ with tsquery and will
return the result if the matching was sucessful.
</p>

<p>
But this result won&rsquo;t be as fast as we wanted. Let&rsquo;s suppose that we
have <i>11K</i> users:
</p>

<pre class="example" id="org3ef957c">
  User |&gt; App.Users.Search.run("meta") |&gt; Repo.explain

  ###
  Filter: (to_tsvector('english'::regconfig,
  (((((username)::text || ' '::text) || (first_name)::text) || ' '::text)
  || (COALESCE(last_name, ' '::character varying))::text)
  @@ to_tsquery('meta:*'::text))

  Rows Removed by Filter: 11285
  Planning time: 1.640 ms
  Execution time: 62.235 ms
  ###
</pre>
</div>
</div>

<div id="outline-container-create-an-index" class="outline-2">
<h2 id="create-an-index"><span class="section-number-2">3</span> Create an index</h2>
<div class="outline-text-2" id="text-create-an-index">
<p>
Auspiciously, we have opportunity to use the PostgreSQL trigram index in
order to improve performance of full-text queries. Let&rsquo;s modify our
transaction:
</p>

<pre class="example" id="orgc40f26c">
  defmodule App.Repo.Migrations.IntroducePgSearch do
    @moduledoc """
    Create postgres extension and indices
    """

    use Ecto.Migration

    def up do
      execute("CREATE EXTENSION pg_trgm")

      execute("""
      CREATE INDEX users_trgm_idx ON users USING GIN (to_tsvector('english',
        username || ' ' || first_name || ' ' || coalesce(last_name, ' ')))
      """)
    end

    def down do
      execute("DROP INDEX users_trgm_idx")
      execute("DROP EXTENSION pg_trgm")
    end
  end
</pre>

<p>
Now run mix do ecto.rollback, eco.migrate and try to run the search:
</p>

<pre class="example" id="orgec04c0a">
  User |&gt; App.Users.Search.run("meta") |&gt; Repo.explain

  ###
  Recheck Cond: (to_tsvector('english'::regconfig, (((((username)::text || ' '::text) || (first_name)::text) || ' '::text) || (COALESCE(last_name, ' '::character varying))::text)) @@ to_tsquery('meta:*'::text))
    Heap Blocks: exact=57
    -&gt;  Bitmap Index Scan on users_trgm_idx  (cost=0.00..20.74 rows=65 width=0) (actual time=0.093..0.093 rows=65 loops=1)
          Index Cond: (to_tsvector('english'::regconfig, (((((username)::text || ' '::text) || (first_name)::text) || ' '::text) || (COALESCE(last_name, ' '::character varying))::text)) @@ to_tsquery('meta:*'::text))

  Planning time: 1.348 ms
  Execution time: 0.457 ms
  ###
</pre>

<p>
Voila! Now that&rsquo;s the speed we wanted. Our users will be so happy with
this search!
</p>
</div>
</div>

<div id="outline-container-conclusion" class="outline-2">
<h2 id="conclusion"><span class="section-number-2">4</span> Conclusion</h2>
<div class="outline-text-2" id="text-conclusion">
<p>
What&rsquo;s next? You can try using the functionality of pg<sub>trgm</sub> module,
search for similar words or making the search not just prefix-only. See
the docs for
<a href="https://www.postgresql.org/docs/10/static/textsearch.html">PostgreSQL
full-text search</a> and
<a href="https://www.postgresql.org/docs/10/static/pgtrgm.html">trigram</a> .
</p>

<p>
Happy hacking!
</p>
</div>
</div>
<div class="taglist"><a href="https://neiro.io/tags.html">Tags</a>: <a href="https://neiro.io/tag-elixir.html">elixir</a> <a href="https://neiro.io/tag-query.html">query</a> <a href="https://neiro.io/tag-postgres.html">postgres</a> <a href="https://neiro.io/tag-search.html">search</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
